import React from "react";
import Product from "./For12Task/Product";
import { useState } from 'react';

function H12() {

  const product = [
    {
      name: "Банан вкусный Российский",
      description:
        "Бананы - это вкусные и полезные фрукты, которые являются отличным источником питательных веществ. Они богаты калием, который помогает регулировать уровень жидкости в организме и поддерживать здоровье сердца. Бананы также содержат витамин C, который помогает укрепить иммунную систему, а также витамин B6, который способствует производству гормонов и обмену веществ.Кроме того, бананы содержат клетчатку, которая помогает поддерживать здоровье пищеварительной системы и предотвращает запоры.",
      price: 5,
    },
    {
      name: "Банан свежий Иранский",
      description:
        "Бананы - это вкусные и полезные фрукты, которые являются отличным источником питательных веществ. Они богаты калием, который помогает регулировать уровень жидкости в организме и поддерживать здоровье сердца. Бананы также содержат витамин C, который помогает укрепить иммунную систему, а также витамин B6, который способствует производству гормонов и обмену веществ.Кроме того, бананы содержат клетчатку, которая помогает поддерживать здоровье пищеварительной системы и предотвращает запоры.",
      price: 10,
    },
    {
      name: "Банан сладкий Алжирский",
      description:
        "Бананы - это вкусные и полезные фрукты, которые являются отличным источником питательных веществ. Они богаты калием, который помогает регулировать уровень жидкости в организме и поддерживать здоровье сердца. Бананы также содержат витамин C, который помогает укрепить иммунную систему, а также витамин B6, который способствует производству гормонов и обмену веществ.Кроме того, бананы содержат клетчатку, которая помогает поддерживать здоровье пищеварительной системы и предотвращает запоры.",
      price: 15,
    },
    {
      name: "Банан ароматный Белорусский",
      description:
        "Бананы - это вкусные и полезные фрукты, которые являются отличным источником питательных веществ. Они богаты калием, который помогает регулировать уровень жидкости в организме и поддерживать здоровье сердца. Бананы также содержат витамин C, который помогает укрепить иммунную систему, а также витамин B6, который способствует производству гормонов и обмену веществ.Кроме того, бананы содержат клетчатку, которая помогает поддерживать здоровье пищеварительной системы и предотвращает запоры.",
      price: 20,
    },
    {
      name: "Банан спелый Американский",
      description:
        "Бананы - это вкусные и полезные фрукты, которые являются отличным источником питательных веществ. Они богаты калием, который помогает регулировать уровень жидкости в организме и поддерживать здоровье сердца. Бананы также содержат витамин C, который помогает укрепить иммунную систему, а также витамин B6, который способствует производству гормонов и обмену веществ.Кроме того, бананы содержат клетчатку, которая помогает поддерживать здоровье пищеварительной системы и предотвращает запоры.",
      price: 25,
    },
    {
      name: "Банан желтый Африканский",
      description:
        "Бананы - это вкусные и полезные фрукты, которые являются отличным источником питательных веществ. Они богаты калием, который помогает регулировать уровень жидкости в организме и поддерживать здоровье сердца. Бананы также содержат витамин C, который помогает укрепить иммунную систему, а также витамин B6, который способствует производству гормонов и обмену веществ.Кроме того, бананы содержат клетчатку, которая помогает поддерживать здоровье пищеварительной системы и предотвращает запоры.",
      price: 30,
    },
  ];

  const [products, setProducts] = useState([...product]);

  const sortByPriceAsc = () => {
    const sortedProducts = [...products];
    sortedProducts.sort((a, b) => a.price - b.price);
    setProducts(sortedProducts);
  };

  const sortByPriceDesc = () => {
    const sortedProducts = [...products];
    sortedProducts.sort((a, b) => b.price - a.price);
    setProducts(sortedProducts);
  };

  const sortByName = () => {
    const sortedProducts = [...products];
    sortedProducts.sort((a, b) => a.name.localeCompare(b.name));
    setProducts(sortedProducts);
  };


  return (
    <>
      <header>
        <nav>
          <ul>
            <li>
              <button onClick={sortByPriceAsc}>
                Сортирока по возрастанию цены
              </button>
            </li>
            <li>
              <button onClick={sortByPriceDesc}>
                Сортировка по убыванию цены
              </button>
            </li>
            <li>
              <button onClick={sortByName}>
                Сортировка по алфавиту
              </button>
            </li>
          </ul>
        </nav>
      </header>
      <div
        style={{ display: "flex", flexWrap: "wrap", justifyContent: "center" }}
      >
        {products.map((product) => (
          <Product
            key={product.name}
            name={product.name}
            description={product.description}
            price={product.price}
          />
        ))}
      </div>
    </>
  );
}

export default H12;
